"""
Repeater Monitor
constants.py

Внутренние константы программы.
"""

# ==========================================================
# SNMP
# ==========================================================

ARP_OID = "1.3.6.1.2.1.4.22.1.2"

# ==========================================================
# ФАЙЛЫ
# ==========================================================

ARP_CACHE_FILE = "arp_cache.json"

OUI_CACHE_FILE = "oui.json"

REPORT_TXT = "last_report.txt"
REPORT_JSON = "last_report.json"
REPORT_CSV = "last_report.csv"

# ==========================================================
# СТАТУСЫ
# ==========================================================

STATUS_NORMAL = "🟢 НОРМАЛЬНЫЙ"

STATUS_WARNING = "🟡 НЕОПРЕДЕЛЁННО"

STATUS_SUSPECT = "🔴 ПОДОЗРИТЕЛЬНЫЙ"

# ==========================================================
# ФОРМАТЫ
# ==========================================================

DATE_FORMAT = "%d.%m.%Y %H:%M:%S"

TABLE_WIDTH = 140

VERBOSE_WIDTH = 180

CSV_ENCODING = "utf-8"

CSV_SEPARATOR = ","

# ==========================================================
# ПОДОЗРИТЕЛЬНЫЕ ПРОИЗВОДИТЕЛИ
# ==========================================================

SUSPECT_VENDOR_KEYWORDS = {

    "tenda",

    "espressif",

    "xiaomi",

    "mercusys",

    "motorola",

    "tp-link",

    "d-link",

    "asus",

    "mikrotik",

    "ubiquiti",

}
